# GetDocument Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetDocument Method
RebarUpdateCurvesData Class See Also
---
Gets a reference to the current document.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Document GetDocument()
```

Visual Basic
---
```text
Public Function GetDocument As Document
```

Visual C++
---
```text
public:
Document^ GetDocument()
```

# ### Return Value
Returns a reference to the current document.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace